### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1454]:
# Dependencies and Setup
import pandas as pd
import numpy as np


# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [1455]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [1456]:
total_players = len(purchase_data_df["SN"].unique())
total_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [1457]:
total_item_ID = len(purchase_data_df["Item ID"].unique())
total_item_ID

179

In [1458]:
average = purchase_data_df ["Price"].mean()
average

3.050987179487176

In [1459]:
total_purchases = len(purchase_data_df["Purchase ID"].unique())
total_purchases

780

In [1460]:
total_revenue = sum(purchase_data_df["Price"])
total_revenue

2379.7699999999973

In [1461]:
# Place all of the data found into a summary DataFrame
summary_df = pd.DataFrame({"Number of Unique Items": [total_item_ID],
                              "Average Purchase Price": average,
                              "Total Number of Purchases": total_purchases,
                              "Total Revenue": total_revenue})
summary_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,179,3.050987,780,2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [1462]:
drop_duplicate = purchase_data_df.drop_duplicates(subset=['SN'])
count_gender = drop_duplicate["Gender"].value_counts() 
count_gender

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [1463]:
Gender_percentage = (count_gender) / (total_players) *100
Gender_percentage.round(2)

Male                     84.03
Female                   14.06
Other / Non-Disclosed     1.91
Name: Gender, dtype: float64

In [1464]:
# Place all of the data found into a summary DataFrame
Gender_Demo_df = pd.DataFrame({"Total Count": count_gender,
                              "Gender Percentage": Gender_percentage})
Gender_Demo_df.round(2)

                       Total Count  Gender Percentage
Male                           484              84.03
Female                          81              14.06
Other / Non-Disclosed           11               1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [1465]:
purchase_count = purchase_data_df["Gender"].value_counts()
purchase_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [1466]:
average_purchase_price = purchase_data_df.groupby(["Gender"]).mean()["Price"]
average_purchase_price.round(2).head()

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [1467]:
average_purchase_value = purchase_data_df.groupby(["Gender"]).sum()["Price"]
average_purchase_value.head()

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [1468]:
average_purchase_total = purchase_data_df.groupby(["Gender"]).sum()["Price"] / count_gender
average_purchase_total.round(2).head()

Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [1469]:
bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [1470]:
pd.cut(purchase_data_df["Age"], bins, labels=group_labels, include_lowest=True)

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [1471]:
purchase_data_df["Age Group"] = pd.cut(purchase_data_df["Age"], bins, labels=group_labels)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

Age_Group = purchase_data_df.groupby("Age Group")

In [1472]:
age_grouped = purchase_data_df.groupby("Age Group")
age_grouped

In [1473]:
total_players_age = age_grouped["SN"].nunique()
total_players_age

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [1474]:
purchase_count_age = age_grouped["Price"].count()
purchase_count_age

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Price, dtype: int64

In [1475]:
average_purchase_total = age_grouped["Price"].mean()
average_purchase_total.round(2)

Age Group
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.94
Name: Price, dtype: float64

In [1476]:
total_purchase_value_age = age_grouped["Price"].sum()
total_purchase_value_age

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [1477]:
average_purchase_total = age_grouped["Price"].sum() / total_players_age
average_purchase_total.round(2)

Age Group
<10      4.54
10-14    3.76
15-19    3.86
20-24    4.32
25-29    3.81
30-34    4.12
35-39    4.76
40+      3.19
dtype: float64

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [1478]:
Age_Demo_df = pd.DataFrame({"Purchase_Count": purchase_count_age,
                              "Average Purchase Price": average_purchase_total,
                              "Total Purchase Value": total_purchase_value_age,
                              "Average Purchase Total Per Person": average_purchase_total })
Age_Demo_df.round(2)

,Purchase_Count,Average Purchase Price,Total Purchase Value,Average Purchase Total Per Person
Age Group,,,,
<10,23,4.54,77.13,4.54
10-14,28,3.76,82.78,3.76
15-19,136,3.86,412.89,3.86
20-24,365,4.32,1114.06,4.32
25-29,101,3.81,293.00,3.81
30-34,73,4.12,214.00,4.12
35-39,41,4.76,147.67,4.76
40+,13,3.19,38.24,3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [1479]:
top_spender = purchase_data_df.groupby(["SN"])
top_spender

In [1480]:
player_purchase_count = top_spender["Purchase ID"].count()
player_purchase_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [1481]:
player_total_purchase_price = top_spender["Price"].sum()
player_total_purchase_price

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [1482]:
player_purchase_price = top_spender["Price"].mean()
player_purchase_price

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [1483]:
Top_Spender_df = pd.DataFrame({"Purchase Count": player_purchase_count,
                              "Average_Purchase_Price": player_purchase_price,
                              "Total Purchase Value": player_total_purchase_price})            
Top_Spender_df.sort_values(by=["Total Purchase Value"], ascending=False).head(5).round(2)

             Purchase Count  Average_Purchase_Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [1484]:
purchase_data_df = purchase_data_df.reset_index()
purchase_data_df

,index,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...,...
775,775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [1485]:
Item_details_df = purchase_data_df[["Item ID","Item Name", "Price"]]
Item_details_df

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [1520]:
popular_items = Item_details_df.groupby(["Item ID","Item Name"])
popular_items

In [1521]:
popular_purchases =  popular_items[["Price"]].count()
popular_purchases

                                                      Price
Item ID Item Name
0       Splinter                                          4
1       Crucifer                                          4
2       Verdict                                           6
3       Phantomlight                                      6
4       Bloodlord's Fetish                                5
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm     12
179     Wolf, Promise of the Moonwalker                   6
181     Reaper's Toll                                     5
182     Toothpick                                         3
183     Dragon's Greatsword                               3

[179 rows x 1 columns]

In [1522]:
item_price = popular_items[["Price"]].mean()
item_price

                                                       Price
Item ID Item Name
0       Splinter                                      1.2800
1       Crucifer                                      2.9425
2       Verdict                                       2.4800
3       Phantomlight                                  2.4900
4       Bloodlord's Fetish                            1.7000
...                                                      ...
178     Oathbreaker, Last Hope of the Breaking Storm  4.2300
179     Wolf, Promise of the Moonwalker               4.4800
181     Reaper's Toll                                 1.6600
182     Toothpick                                     4.0300
183     Dragon's Greatsword                           1.0900

[179 rows x 1 columns]

In [1523]:
Total_purchase_value = popular_items[["Price"]].sum()
Total_purchase_value

                                                      Price
Item ID Item Name
0       Splinter                                       5.12
1       Crucifer                                      11.77
2       Verdict                                       14.88
3       Phantomlight                                  14.94
4       Bloodlord's Fetish                             8.50
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm  50.76
179     Wolf, Promise of the Moonwalker               26.88
181     Reaper's Toll                                  8.30
182     Toothpick                                     12.09
183     Dragon's Greatsword                            3.27

[179 rows x 1 columns]

In [1524]:
popular_items_df = pd.DataFrame({"Purchase Count": popular_purchases["Price"], 
                                    "Item Price": item_price["Price"],
                                    "Total Purchase Value": Total_purchase_value["Price"]})
popular_items_df.sort_values(by=["Purchase Count"], ascending=False).head(5).round(2)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.61,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
132,Persuasion,9,3.22,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77

## Most Profitable Items

popular_items_df.sort_values(by=["Total Purchase Value"], ascending=False).head(5).round(2)

In [1525]:
popular_items_df.sort_values(by=["Total Purchase Value"], ascending=False).head(5).round(2)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.61,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
103,Singed Scalpel,8,4.35,34.80

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame